cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_ctlreq.c
    while ((if_ix < USBH_MAX_NUM_INTERFACES) && (ptr < cfg_desc->wTotalLength))
    {
      if (count++ > 100) {
          printf("USB%u.%u.%u Descrptor processing failure\n", get_port(phost), phost->address, if_ix);
          break;
      }
      pdesc = USBH_GetNextDesc((uint8_t *)(void *)pdesc, &ptr);
      if (pdesc->bDescriptorType == USB_DESC_TYPE_INTERFACE) {
        if (USBH_ClassIsValid(phost, (uint8_t *)pdesc)) {
          pif = &cfg_desc->Itf_Desc[if_ix];
          USBH_ParseInterfaceDesc(pif, (uint8_t *)(void *)pdesc);

          ep_ix = 0U;
          pep = (USBH_EpDescTypeDef *)0;
          while ((ep_ix < pif->bNumEndpoints) && (ptr < cfg_desc->wTotalLength))
          {
            if (count++ > 100) {
                printf("USB%u.%u.%u Descrptor processing failure (inner)\n", get_port(phost), phost->address, if_ix);
                break;
            }
            pdesc = USBH_GetNextDesc((uint8_t *)(void *)pdesc, &ptr);
            if (pdesc->bDescriptorType == USB_DESC_TYPE_ENDPOINT)
            {
              pep = &cfg_desc->Itf_Desc[if_ix].Ep_Desc[ep_ix];
              USBH_ParseEPDesc(pep, (uint8_t *)(void *)pdesc);
              ep_ix++;
            }
          }
        }
        if_ix++;
      }
    }
    if (cfg_desc->bNumInterfaces != if_ix) {
        USBH_ErrLog("USB%u.%u num interfaces %u != descriptor %u\n",
                    get_port(phost), phost->address,
                    if_ix, cfg_desc->bNumInterfaces);
        cfg_desc->bNumInterfaces = if_ix;
    }
  }
}


/**
  * @brief  USBH_ParseInterfaceDesc
  *         This function Parses the interface descriptor
  * @param  if_descriptor : Interface descriptor destination
  * @param  buf: Buffer where the descriptor data is available
  * @retval None
  */
static void  USBH_ParseInterfaceDesc(USBH_InterfaceDescTypeDef *if_descriptor,
                                     uint8_t *buf)
{
  if_descriptor->bLength            = *(uint8_t *)(buf + 0);
  if_descriptor->bDescriptorType    = *(uint8_t *)(buf + 1);
  if_descriptor->bInterfaceNumber   = *(uint8_t *)(buf + 2);
  if_descriptor->bAlternateSetting  = *(uint8_t *)(buf + 3);
  if_descriptor->bNumEndpoints      = *(uint8_t *)(buf + 4);
  if_descriptor->bInterfaceClass    = *(uint8_t *)(buf + 5);
  if_descriptor->bInterfaceSubClass = *(uint8_t *)(buf + 6);
  if_descriptor->bInterfaceProtocol = *(uint8_t *)(buf + 7);
  if_descriptor->iInterface         = *(uint8_t *)(buf + 8);
}


/**
  * @brief  USBH_ParseEPDesc
  *         This function Parses the endpoint descriptor
  * @param  ep_descriptor: Endpoint descriptor destination address
  * @param  buf: Buffer where the parsed descriptor stored
  * @retval None
  */
static void  USBH_ParseEPDesc(USBH_EpDescTypeDef  *ep_descriptor,
                              uint8_t *buf)
{
  ep_descriptor->bLength          = *(uint8_t *)(buf + 0);
  ep_descriptor->bDescriptorType  = *(uint8_t *)(buf + 1);
  ep_descriptor->bEndpointAddress = *(uint8_t *)(buf + 2);
  ep_descriptor->bmAttributes     = *(uint8_t *)(buf + 3);
  ep_descriptor->wMaxPacketSize   = LE16(buf + 4);
  ep_descriptor->bInterval        = *(uint8_t *)(buf + 6);
}


/**
  * @brief  USBH_ParseStringDesc
  *         This function Parses the string descriptor
  * @param  psrc: Source pointer containing the descriptor data
  * @param  pdest: Destination address pointer
  * @param  length: Length of the descriptor
  * @retval None
  */
static void USBH_ParseStringDesc(uint8_t *psrc, uint8_t *pdest, uint16_t length)
{
  uint16_t strlength;
  uint16_t idx;

  /* The UNICODE string descriptor is not NULL-terminated. The string length is
  computed by substracting two from the value of the first byte of the descriptor.
  */

  /* Check which is lower size, the Size of string or the length of bytes read
  from the device */

  if (psrc[1] == USB_DESC_TYPE_STRING)
  {
    /* Make sure the Descriptor is String Type */

    /* psrc[0] contains Size of Descriptor, subtract 2 to get the length of string */
    strlength = ((((uint16_t)psrc[0] - 2U) <= length) ? ((uint16_t)psrc[0] - 2U) : length);

    /* Adjust the offset ignoring the String Len and Descriptor type */
    psrc += 2U;

    for (idx = 0U; idx < strlength; idx += 2U)
    {
      /* Copy Only the string and ignore the UNICODE ID, hence add the src */
      *pdest =  psrc[idx];
      pdest++;
    }
    *pdest = 0U; /* mark end of string */
  }
}


/**
  * @brief  USBH_GetNextDesc
  *         This function return the next descriptor header
  * @param  buf: Buffer where the cfg descriptor is available
  * @param  ptr: data pointer inside the cfg descriptor
  * @retval next header
  */
USBH_DescHeader_t  *USBH_GetNextDesc(uint8_t   *pbuf, uint16_t  *ptr)
{
  USBH_DescHeader_t  *pnext;
  uint16_t len = ((USBH_DescHeader_t *)(void *)pbuf)->bLength;

  if (len == 0)
      len = 1;  // Work around broken descriptors

  *ptr += len;
  pnext = (USBH_DescHeader_t *)(void *)((uint8_t *)(void *)pbuf + len);

  return (pnext);
}


/**
  * @brief  USBH_CtlReq
  *         USBH_CtlReq sends a control request and provide the status after
  *            completion of the request
  * @param  phost: Host Handle
  * @param  req: Setup Request Structure
  * @param  buff: data buffer address to store the response
  * @param  length: length of the response
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_CtlReq(USBH_HandleTypeDef *phost, uint8_t *buff,
                               uint16_t length)
{
  USBH_StatusTypeDef status;
  status = USBH_BUSY;

  switch (phost->RequestState)
  {
    case CMD_SEND:
      /* Start a SETUP transfer */
      phost->Control.buff = buff;
      phost->Control.length = length;
      phost->Control.state = CTRL_SETUP;
      phost->RequestState = CMD_WAIT;
      status = USBH_BUSY;
      phost->busy++;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_CONTROL_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      break;

