cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_ctlreq.c
    case CMD_WAIT:
      status = USBH_HandleControl(phost);
      if (status == USBH_OK)
      {
        /* Commands successfully sent and Response Received  */
        phost->RequestState = CMD_SEND;
        phost->Control.state = CTRL_IDLE;
        status = USBH_OK;
      }
      else if (status == USBH_NOT_SUPPORTED)
      {
        /* Commands successfully sent and Response Received  */
        phost->RequestState = CMD_SEND;
        phost->Control.state = CTRL_IDLE;
        status = USBH_NOT_SUPPORTED;
      }
      else
      {
        if (status == USBH_FAIL)
        {
          /* Failure Mode */
          phost->RequestState = CMD_SEND;  // Return to "ready to send" state
          USBH_UsrLog("USB%u.%u USBH_CtlReq FAIL\n", get_port(phost), phost->address);
          status = USBH_FAIL;
        }
      }
      break;

    case CMD_ERROR:
      break;
    default:
      break;
  }
  if (status != USBH_BUSY)
      phost->busy--;
  return status;
}

/**
  * @brief  USBH_HandleControl
  *         Handles the USB control transfer state machine
  * @param  phost: Host Handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HandleControl(USBH_HandleTypeDef *phost)
{
  uint8_t direction;
  USBH_StatusTypeDef status = USBH_BUSY;
  USBH_URBStateTypeDef URB_Status = USBH_URB_IDLE;

  switch (phost->Control.state)
  {
    case CTRL_SETUP:
      /* send a SETUP packet */
      DPRINTF("USB%u.%u ctrlsetup in=%x out=%x l=%x pipe=%x [%02x %02x %02x]\n", get_port(phost), phost->address, phost->InEp, phost->OutEp, phost->Control.length, phost->Control.pipe_out, phost->Control.buff[0], phost->Control.buff[1], phost->Control.buff[2]);

      USBH_CtlSendSetup(phost, (uint8_t *)(void *)phost->Control.setup.d8,
                        phost->Control.pipe_out);

      phost->Control.state = CTRL_SETUP_WAIT;
      phost->Control.timer = phost->Timer;
      break;

    case CTRL_SETUP_WAIT:

      URB_Status = USBH_LL_GetURBState(phost, phost->Control.pipe_out);
      /* case SETUP packet sent successfully */
      if (URB_Status == USBH_URB_DONE)
      {
        DPRINTF(" CTRL_SETUP_WAIT=done");
        direction = (phost->Control.setup.b.bmRequestType & USB_REQ_DIR_MASK);

        /* check if there is a data stage */
        if (phost->Control.setup.b.wLength.w != 0U)
        {
          if (direction == USB_D2H)
          {
            /* Data Direction is IN */
            phost->Control.state = CTRL_DATA_IN;
            DPRINTF(" CTRL_DATA_IN");
          }
          else
          {
            /* Data Direction is OUT */
            phost->Control.state = CTRL_DATA_OUT;
            DPRINTF(" CTRL_DATA_OUT 1");
          }
        }
        /* No DATA stage */
        else
        {
          /* If there is No Data Transfer Stage */
          if (direction == USB_D2H)
          {
            /* Data Direction is IN */
            phost->Control.state = CTRL_STATUS_OUT;
            DPRINTF(" CTRL_STATUS_OUT 1");
          }
          else
          {
            /* Data Direction is OUT */
            phost->Control.state = CTRL_STATUS_IN;
            DPRINTF(" CTRL_STATUS_IN 1");
          }
        }

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_CONTROL_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      }
      else
      {
        if ((URB_Status == USBH_URB_ERROR) || (URB_Status == USBH_URB_NOTREADY))
        {
          phost->Control.state = CTRL_ERROR;
          DPRINTF(" CTRL_ERROR 1");

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_CONTROL_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
        } else {
          if ((phost->Timer - phost->Control.timer) > 1000U) {
            DPRINTF("Timeout");
            status = USBH_FAIL;
            return (USBH_FAIL);
//          phost->Control.state = CTRL_ERROR;
          }
        }
      }
      break;

    case CTRL_DATA_IN:
      /* Issue an IN token */
      phost->Control.timer = (uint16_t)phost->Timer;
      USBH_CtlReceiveData(phost, phost->Control.buff, phost->Control.length,
                          phost->Control.pipe_in);

      phost->Control.state = CTRL_DATA_IN_WAIT;
      DPRINTF(" CTRL_DATA_IN_WAIT");
      break;

    case CTRL_DATA_IN_WAIT:

      URB_Status = USBH_LL_GetURBState(phost, phost->Control.pipe_in);

      /* check is DATA packet transferred successfully */
      if (URB_Status == USBH_URB_DONE)
      {
        phost->Control.state = CTRL_STATUS_OUT;
        DPRINTF(" CTRL_STATUS_OUT 2");

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_CONTROL_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      }

      /* manage error cases*/
      if (URB_Status == USBH_URB_STALL)
      {
        /* In stall case, return to previous machine state */
        status = USBH_NOT_SUPPORTED;
        DPRINTF(" STALL");

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_CONTROL_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
      }
      else
      {
        if (URB_Status == USBH_URB_ERROR)
        {
          /* Device error */
          phost->Control.state = CTRL_ERROR;
          DPRINTF(" CTRL_ERROR 2");

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_CONTROL_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
        }
      }
      break;

    case CTRL_DATA_OUT:

      USBH_CtlSendData(phost, phost->Control.buff, phost->Control.length,
                       phost->Control.pipe_out, 1U);

      phost->Control.timer = (uint16_t)phost->Timer;
      phost->Control.state = CTRL_DATA_OUT_WAIT;
      DPRINTF(" CTRL_DATA_OUT_WAIT");
      break;

